<a href="https://colab.research.google.com/github/Git-Hub-Ran/Python/blob/main/notebooks/python_basics/02-mini-etl-pipeline.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<div style="text-align: left">

# üêç Mini ETL Pipeline in Python

---

## üìù Task Description

**Goal:** Implement a mini **ETL pipeline** using Python and pandas.

### Steps:
1. üìÇ **Load a raw data file**  
   e.g., a CSV of sales or sensor data.
2. üßπ **Clean / Transform the data**  
   - Filter, aggregate, or modify columns as needed.
3. üìä **Output a summary or visualization**  
   - Aggregate totals per category  
   - Plot the results

This project helps you **solidify Python skills** and demonstrates your ability to apply **data engineering principles** in code.

In [8]:
import pandas as pd

#Read a csv file with Sales data:
url = "https://gist.githubusercontent.com/denandreychuk/b9aa812f10e4b60368cff69c6384a210/raw/100%20Sales%20Records.csv"
df = pd.read_csv(url)

#Chacking if 'Order ID' can be an index:
print(df['Order ID'].is_unique)

True

In [15]:
#Define 'Order ID' as Index:
df.set_index('Order ID')

#Shows amount of orders per country:
grouped=df.groupby('Country').Country.count().rename('Count')

#See the country with the highest amount of orders on top:
grouped.sort_values(ascending=False)

Country
The Gambia               4
Australia                3
Djibouti                 3
Sao Tome and Principe    3
Mexico                   3
                        ..
Sri Lanka                1
Syria                    1
Tuvalu                   1
United Kingdom           1
Zambia                   1
Name: Count, Length: 76, dtype: int64

In [16]:

#show the total amount of countries:
len(grouped.index)

#Plot the results:

76